In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [2]:
df = pd.read_csv('bank_transactions.csv')
df.shape

(1048567, 9)

In [3]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5

In [5]:
df.columns

Index(['TransactionID', 'CustomerID', 'CustomerDOB', 'CustGender',
       'CustLocation', 'CustAccountBalance', 'TransactionDate',
       'TransactionTime', 'TransactionAmount (INR)'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048567 entries, 0 to 1048566
Data columns (total 9 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   TransactionID            1048567 non-null  object
 1   CustomerID               1048567 non-null  object
 2   CustomerDOB              1045170 non-null  object
 3   CustGender               1047467 non-null  object
 4   CustLocation             1048416 non-null  object
 5   CustAccountBalance       1046198 non-null  float64
 6   TransactionDate          1048567 non-null  object
 7   TransactionTime          1048567 non-null  int64
 8   TransactionAmount (INR)  1048567 non-null  float64
dtypes: float64(2), int64(1), object(6)
memory usage: 72.0+ MB

In [7]:
# let's check unique values
columns=df.columns
for col in columns:
    print(col,':\n',df[col].unique())
    print(df[col].value_counts())
    print('\n',20*'**','\n')

TransactionID :
 ['T1' 'T2' 'T3' ... 'T1048565' 'T1048566' 'T1048567']
T1          1
T699051     1
T699038     1
T699039     1
T699040     1
           ..
T349528     1
T349529     1
T349530     1
T349531     1
T1048567    1
Name: TransactionID, Length: 1048567, dtype: int64

 ****************************************

CustomerID :
 ['C5841053' 'C2142763' 'C4417068' ... 'C8020229' 'C6459278' 'C6420483']
C5533885    6
C6624352    6
C1736254    6
C6735477    6
C1113684    6
           ..
C8716232    1
C4474828    1
C3341662    1
C6821983    1
C6420483    1
Name: CustomerID, Length: 884265, dtype: int64

 ****************************************

CustomerDOB :
 ['10/1/94' '4/4/57' '26/11/96' ... '18/7/65' '15/5/42' '24/10/44']
1/1/1800    57339
1/1/89        809
1/1/90        784
6/8/91        699
1/1/91        666
            ...
3/9/60          1
17/11/52        1
11/9/63         1
28/2/47         1
24/10/44        1
Name: CustomerDOB, Length: 17254, dtype: int64

 ****************************************

CustGender :
 ['F' 'M' nan 'T']
M    765530
F    281936
T         1
Name: CustGender, dtype: int64

 ****************************************

CustLocation :
 ['JAMSHEDPUR' 'JHAJJAR' 'MUMBAI' ... 'KARANJIA'
 'NR HERITAGE FRESH HYDERABAD' 'IMPERIA THANE WEST']
MUMBAI                         103595
NEW DELHI                       84928
BANGALORE                       81555
GURGAON                         73818
DELHI                           71019
                                ...
ROAD (E) THANE                      1
TO APOLO PHARMACY BANGALORE         1
PILLAR NO 725 NEW DELHI             1
COMPANY BANGALORE                   1
IMPERIA THANE WEST                  1
Name: CustLocation, Length: 9355, dtype: int64

 ****************************************

CustAccountBalance :
 [ 17819.05   2270.69  17874.44 ... 182889.37  15037.89   1002.96]
0.00        2711
45856.24     538
27021.05     514
10238.63     401
0.01         300
            ...
24755.11       1
389.50         1
23917.66       1
51442.90       1
1002.96        1
Name: CustAccountBalance, Length: 161328, dtype: int64

 ****************************************

TransactionDate :
 ['2/8/16' '1/8/16' '3/8/16' '5/8/16' '4/8/16' '6/8/16' '9/8/16' '8/8/16'
 '12/8/16' '7/8/16' '21/10/16' '16/10/16' '10/8/16' '14/8/16' '17/8/16'
 '21/8/16' '19/8/16' '24/8/16' '22/8/16' '29/8/16' '31/8/16' '22/9/16'
 '23/9/16' '13/8/16' '25/8/16' '28/8/16' '15/8/16' '27/8/16' '20/8/16'
 '23/8/16' '30/8/16' '11/8/16' '16/8/16' '26/8/16' '27/9/16' '18/8/16'
 '25/9/16' '26/9/16' '30/9/16' '3/9/16' '2/9/16' '1/9/16' '6/9/16'
 '5/9/16' '4/9/16' '9/9/16' '8/9/16' '7/9/16' '12/9/16' '11/9/16'
 '10/9/16' '15/9/16' '14/9/16' '13/9/16' '18/9/16']
7/8/16      27261
13/8/16     26921
6/8/16      26585
4/9/16      26564
3/9/16      26431
10/9/16     25761
14/8/16     25596
11/9/16     25454
15/8/16     24171
21/8/16     22986
2/9/16      22839
12/8/16     22438
1/9/16      22327
11/8/16     21833
9/8/16      21823
8/9/16      21765
10/8/16     21649
9/9/16      21568
27/8/16     21469
20/8/16     21339
5/9/16      21221
7/9/16      21161
17/8/16     21121
5/8/16      21112
28/8/16     21054
8/8/16      21042
2/8/16      20948
12/9/16     20753
4/8/16      20682
3/8/16      20615
13/9/16     20601
1/8/16      20438
16/8/16     20414
14/9/16     19969
15/9/16     19754
31/8/16     19711
6/9/16      19640
18/8/16     19453
19/8/16     18714
22/8/16     18558
25/8/16     18546
24/8/16     18026
26/8/16     17742
30/8/16     17430
23/8/16     17374
29/8/16     16882
18/9/16     14689
26/9/16     12460
25/9/16      8164
27/9/16      7447
22/9/16      6971
21/10/16     3656
23/9/16      3485
30/9/16      1951
16/10/16        3
Name: TransactionDate, dtype: int64

 ****************************************

TransactionTime :
 [143207 141858 142712 ...  65244  81817  71955]
193303    46
195002    46
202738    46
195708    45
202709    45
          ..
64254      1
60719      1
55         1
60332      1
71955      1
Name: TransactionTime, Length: 81918, dtype: int64

 ****************************************

TransactionAmount (INR) :
 [2.5000e+01 2.7999e+04 4.5900e+02 ... 5.9886e+02 6.0907e+02 5.2590e+03]
100.00     34392
200.00     31284
50.00      30781
500.00     29243
1000.00    23459
           ...
659.36         1
319.71         1
3095.05        1
1417.24        1
5259.00        1
Name: TransactionAmount (INR), Length: 93024, dtype: int64

 ****************************************

In [8]:
df.describe()

       CustAccountBalance  TransactionTime  TransactionAmount (INR)
count        1.046198e+06     1.048567e+06             1.048567e+06
mean         1.154035e+05     1.570875e+05             1.574335e+03
std          8.464854e+05     5.126185e+04             6.574743e+03
min          0.000000e+00     0.000000e+00             0.000000e+00
25%          4.721760e+03     1.240300e+05             1.610000e+02
50%          1.679218e+04     1.642260e+05             4.590300e+02
75%          5.765736e+04     2.000100e+05             1.200000e+03
max          1.150355e+08     2.359590e+05             1.560035e+06

In [9]:
df.dtypes

TransactionID               object
CustomerID                  object
CustomerDOB                 object
CustGender                  object
CustLocation                object
CustAccountBalance         float64
TransactionDate             object
TransactionTime              int64
TransactionAmount (INR)    float64
dtype: object

In [10]:
plt.style.use("seaborn")
df.hist(figsize=(25,20), bins=15)

AttributeError: module 'matplotlib' has no attribute 'style'